{"nodes": [{"id": "0", "name": "Cloud Analytics Web Platform", "group": 1, "description": "We are building a high-performance web platform for cloud-based analytics using React and Node.js. The platform features real-time data visualization, interactive dashboards, and advanced analytics capabilities. It includes features like data streaming, automated reporting, and customizable widgets for business intelligence.", "connections": 3}, {"id": "1", "name": "Company Intranet Portal", "group": 1, "description": "The second web project is a company intranet portal with advanced search and document versioning using Vue.js and Django. The portal includes features like role-based access control, document collaboration tools, advanced search with filters, automated workflow approvals, and integration with existing enterprise systems.", "connections": 3}, {"id": "2", "name": "IT Services Monitoring Dashboard", "group": 1, "description": "Our third web application is a client-facing dashboard for IT services monitoring built with Angular and Flask. The dashboard provides real-time system health monitoring, performance metrics, alert management, and automated incident reporting. It includes customizable views, historical data analysis, and integration with popular monitoring tools.", "connections": 4}, {"id": "3", "name": "Team Communication Android App", "group": 2, "description": "The mobile team is working on an Android app for internal team communication, featuring chat, video calls, and shared notes. The app includes end-to-end encryption, offline message synchronization, file sharing capabilities, team channels, and integration with calendar and task management systems.", "connections": 4}, {"id": "4", "name": "Cross-Platform Fitness Tracker", "group": 2, "description": "Another mobile project involves developing a cross-platform fitness tracking app using Flutter and Firebase. The app includes features like workout tracking, nutrition monitoring, social sharing, progress analytics, and integration with wearable devices. It supports offline functionality and real-time synchronization across multiple devices.", "connections": 5}, {"id": "5", "name": "iOS Biometric Login App", "group": 2, "description": "We're also creating an iOS-only app for secure biometric login to our IT systems, leveraging Face ID and Swift. The app implements advanced security protocols, multi-factor authentication, secure key storage, and seamless integration with enterprise SSO systems. It includes audit logging and compliance reporting features.", "connections": 4}, {"id": "6", "name": "Offline Document Editor", "group": 2, "description": "A separate mobile project is focused on offline document editing and sync features using Kotlin Multiplatform. The app supports multiple document formats, collaborative editing, version control, and automatic conflict resolution. It includes features like document sharing, commenting, and integration with cloud storage services.", "connections": 4}, {"id": "7", "name": "AI-Powered Phishing Detector", "group": 3, "description": "In cybersecurity, one project is developing an AI-powered phishing detection system trained on internal email patterns. The system uses machine learning algorithms to analyze email content, sender behavior, and URL patterns. It includes real-time threat detection, automated response actions, and detailed security analytics reporting.", "connections": 1}, {"id": "8", "name": "Blockchain-Based Access Control", "group": 3, "description": "Another cybersecurity effort is focused on role-based access control and security auditing using blockchain tech. The system implements smart contracts for access management, immutable audit logs, and automated compliance reporting. It includes features like multi-signature authentication and integration with existing identity management systems.", "connections": 3}, {"id": "9", "name": "Smart Document Scanner (IoT)", "group": 4, "description": "Our IoT team is developing a smart document scanner that logs metadata directly to our central management platform. The device includes OCR capabilities, automatic document classification, and real-time data extraction. It features cloud connectivity, secure data transmission, and integration with document management systems.", "connections": 7}], "links": [{"source": "0", "target": "1", "value": 0.3128485083580017}, {"source": "0", "target": "2", "value": 0.6016236543655396}, {"source": "0", "target": "9", "value": 0.3198493719100952}, {"source": "1", "target": "2", "value": 0.425510048866272}, {"source": "1", "target": "6", "value": 0.3355731964111328}, {"source": "2", "target": "4", "value": 0.34592610597610474}, {"source": "2", "target": "9", "value": 0.3063058853149414}, {"source": "3", "target": "4", "value": 0.5215615034103394}, {"source": "3", "target": "5", "value": 0.3632749021053314}, {"source": "3", "target": "6", "value": 0.5073462724685669}, {"source": "3", "target": "9", "value": 0.36507314443588257}, {"source": "4", "target": "5", "value": 0.3684309720993042}, {"source": "4", "target": "6", "value": 0.4792226254940033}, {"source": "4", "target": "9", "value": 0.3258083462715149}, {"source": "5", "target": "8", "value": 0.4597138464450836}, {"source": "5", "target": "9", "value": 0.3530445992946625}, {"source": "6", "target": "9", "value": 0.4146577715873718}, {"source": "7", "target": "8", "value": 0.39495596289634705}, {"source": "8", "target": "9", "value": 0.3572889566421509}], "metadata": {"field_groups": {"web": 1, "mobile": 2, "cybersecurity": 3, "iot": 4}, "total_nodes": 10, "total_links": 19}}