{"nodes": [{"id": "0", "name": "2ThemartComInc_19990826_10-12G_EX-10.10_6700288_EX-10.10_Co-Branding Agreement_ Agency Agreement.txt", "group": 5, "description": "CO-BRANDING AND ADVERTISING AGREEMENT\n\nTHIS CO-BRANDING AND ADVERTISING AGREEMENT (the \"Agreement\") is made as of June 21, 1999 (the \"Effective Date\") by and between I-ESCROW, INC., with its principal place of business at 1730 S. Amphlett Blvd., Suite 233, San Mateo, California 94402 (\"i-Escrow\"), and 2THEMART.COM, INC. having its principal place of business at 18301 Von Karman Avenue, 7th Floor, Irvine, California 92612 (\"2TheMart\").\n\n1. DEFINITIONS.\n\n(a) \"CONTENT\" means all content or information, in any medium, provided by a party to the other party for use in conjunction with the performance of its obligations hereunder, including without limitation any text, music, sound, photographs, video, graphics, data or software. Content provided by 2TheMart is referred to herein as \"2TheMart Content\" and Content provided by i-Escrow is referred to herein as \"i-Escrow Content.\"\n\n(b) \"CO-BRANDED SITE\" means the web-site accessible through Domain Name, for the Services implemented by i-Escrow.", "connections": 0}, {"id": "1", "name": "ABILITYINC_06_15_2020-EX-4.25-SERVICES AGREEMENT.txt", "group": 5, "description": "EXHIBIT 4.25 INFORMATION IN THIS EXHIBIT IDENTIFIED BY [ * * * ] IS CONFIDENTIAL AND HAS BEEN EXCLUDED BECAUSE IT IS BOTH (I) NOT MATERIAL AND (II) WOULD LIKELY CAUSE COMPETITIVE HARM TO THE REGISTRANT IF PUBLICLY DISCLOSED. SERVICES AGREEMENT This Services Agreement (this \"Agreement\") is entered into on October 1, 2019 and is made effective as of November 1, 2019 (the \"Effective Date\"), by and between [ * * * ] (the \"Provider\"), and TELCOSTAR PTE, LTD., a company organized and existing under the laws of Singapore and Ability Computer & Software Industries Ltd, a company organized and existing under the laws of the State of Israel (each and both of them \"Recipient\"). Each of the foregoing parties is referred to herein as a \"Party\" and together as the \"Parties\". RECITALS A. Recipient wishes to engage the Provider to provide certain services and resources (the \"Services\") and Provider desires to provide Recipient with the Services all in accordance with the terms and conditions set forth", "connections": 2}, {"id": "2", "name": "ACCELERATEDTECHNOLOGIESHOLDINGCORP_04_24_2003-EX-10.13-JOINT VENTURE AGREEMENT.txt", "group": 5, "description": "EXHIBIT 10.13\n\n                             JOINT VENTURE AGREEMENT\n\nCollectible Concepts Group, Inc. (\"CCGI\") and Pivotal Self Service Tech, Inc. (\"PVSS\"), (the \"Parties\" or \"Joint Venturers\" if referred to collectively, or the \"Party\" or Joint Venturer\" if referred to singularly), by this Agreement associate themselves as business associates, and not as partners, in the formation of a joint venture (the \"Joint Venture\"), for the purpose of engaging generally in the business provided for by terms and provisions of this Agreement.\n\n1.   Name of the Joint Venture. The name of the Joint Venture will be MightyCell      Batteries, and may sometimes be referred to as \"MightyCell\" or the \"Joint      Venture\" in this Agreement. The principal office and place of business      shall be located in 1600 Lower State Road, Doylestown, PA 18901.\n\n2.   Scope of the Joint Venture Business. The Joint Venture is formed for the      purpose of engaging generally in the business of marketing batteries and", "connections": 0}, {"id": "3", "name": "ACCURAYINC_09_01_2010-EX-10.31-DISTRIBUTOR AGREEMENT.txt", "group": 5, "description": "Exhibit 10.31    PURSUANT TO 17 C.F.R. § 240.24B-2, CONFIDENTIAL INFORMATION (INDICATED BY {*****}) HAS BEEN OMITTED FROM THIS  DOCUMENT AND HAS BEEN FILED SEPARATELY WITH THE SECURITIES AND EXCHANGE COMMISSION PURSUANT TO A  CONFIDENTIAL TREATMENT APPLICATION FILED WITH THE COMMISSION     ACCURAY INCORPORATED  MULTIPLE LINAC AND MULTI-MODALITY   DISTRIBUTOR AGREEMENT     This Multiple LINAC and Multi-Modality Distributor Agreement (\"Agreement\") is entered into by and between ACCURAY  INCORPORATED, a Delaware corporation with its executive offices located at 1310 Chesapeake Terrace, Sunnyvale, California 94089, USA  (\"Accuray\"), and SIEMENS AKTIENGESELLSCHAFT, a corporation formed under the laws of the Federal Republic of Germany, with its registered  offices located at Berlin and Munich (\"Siemens\"), as of June 8, 2010 (\"Effective Date\").     RECITALS     Accuray manufactures and sells full-body radiosurgery systems using image-guided robotics, including the CyberKnife® Robotic  Radios", "connections": 4}, {"id": "4", "name": "ADAMSGOLFINC_03_21_2005-EX-10.17-ENDORSEMENT AGREEMENT.txt", "group": 5, "description": "REDACTED COPY\n\nCONFIDENTIAL TREATMENT REQUESTED\n\nCONFIDENTIAL PORTIONS OF THIS\n\nDOCUMENT HAVE BEEN REDACTED\n\nAND HAVE BEEN SEPARATELY\n\nFILED WITH THE COMMISSION\n\n  1\n\n\n\n\n\nENDORSEMENT AGREEMENT\n\nThis Agreement is entered into on January 13, 2005 between professional golfer, TOM WATSON, (hereinafter referred to as \"CONSULTANT\") and ADAMS GOLF, LTD. (hereinafter referred to as \"ADAMS GOLF\").\n\nWITNESSETH\n\nWHEREAS, ADAMS GOLF desires to obtain the right to use the name, likeness and ENDORSEMENT of CONSULTANT in connection with the advertisement and promotion of ADAMS GOLF'S PRODUCT;\n\nNOW THEREFORE, in consideration of the mutual covenants contained herein and other good and valuable consideration, the receipt and sufficiency of which is hereby acknowledged, the parties agree as follows:\n\nCONTRACT PERIOD\n\n1.   TERM OF CONTRACT\n\nThe Term of this Agreement shall be for a period of [* ****] years and [*****] months commencing the 1st day of September 2004 and terminating the [*****] day of [***", "connections": 1}, {"id": "5", "name": "ADAPTIMMUNETHERAPEUTICSPLC_04_06_2017-EX-10.11-STRATEGIC ALLIANCE AGREEMENT.txt", "group": 5, "description": "Exhibit 10.11   ***Certain portions of this exhibit have been omitted based on a request for confidential treatment pursuant to Rule 24b-2 under the Securities Exchange Act of 1934, as amended. The omitted portions have been filed separately with the Securities and Exchange Commission.   STRATEGIC ALLIANCE AGREEMENT     This Strategic Collaboration Agreement (\"Agreement\"), effective as of the 23rd day of  September, 2016 (\"Effective Date\"), is entered into by and between The University of Texas M. D. Anderson Cancer Center, with a place of business located at 1515 Holcombe Blvd., Houston, TX 77030, USA (\"MD Anderson\"), a member institution of The University of Texas System (\"System\") and Adaptimmune LLC, with a place of business located at 2001 Market Street, Philadelphia, PA 1903, USA (\"Adaptimmune\"); and Adaptimmune Limited, with a place of business at 101 Milton Park, Abingdon, Oxfordshire, OX14 4RY (\"Adaptimmune Limited\") (MD Anderson and Adaptimmune each a \"Party\" and collectively", "connections": 2}, {"id": "6", "name": "ADIANUTRITION,INC_04_01_2005-EX-10.D2-RESELLER AGREEMENT.txt", "group": 5, "description": "Exhibit 10d-2\n\n                               RESELLER AGREEMENT\n\n                                 BY AND BETWEEN\n\n                                PIVX CORPORATION\n\n                                       AND\n\n                               DETTO TECHNOLOGIES\n\nThis Reseller Agreement is entered as of this ___ day of _________, 2004 (\"Effective Date\") by and between PivX Corporation, a California corporation, having its principal place of business at 23 Corporate Plaza Drive, Newport Beach, California, 92661 (\"PivX\") and Detto Technologies, a Washington corporation, having its principal place of business at 14320 NE 21st Street, Suite 11, Bellevue, Washington, 98007 (\"Detto\").\n\nNOW THEREFORE, for good and valuable consideration, the parties hereby agree as follows:\n\n1. GRANT OF RIGHTS\n\n1.1 LICENSE. Subject to the terms and conditions of this Agreement, PivX hereby grants to Detto a non-transferable, exclusive license to distribute PivX's Qwik-Fix Pro and any documentation supporting Qwik", "connections": 0}, {"id": "7", "name": "ADMA BioManufacturing, LLC -  Amendment #3 to Manufacturing Agreement .txt", "group": 5, "description": "Confidential treatment has been requested with respect to portions of this agreement as indicated by \"[***]\" and such confidential portions have been deleted and filed separately with the Securities and Exchange Commission pursuant to Rule 24b-2 of the Securities Exchange Act of 1934, as amended. Amendment #3 to the Manufacturing Agreement This Amendment #3 to the Manufacturing Agreement (this \"Amendment #3\") is made effective as of December 21, 2017 (\"Amendment Effective Date\"), by and between ADMA BioManufacturing, LLC, a Delaware limited liability company, having a place of business at 5800 Park of Commerce Boulevard NW, Boca Raton, Florida 33487 USA (\"ADMA\") and Sanofi Pasteur S.A., a company existing and organized under the laws of France (\"Sanofi Pasteur\"), having its registered head office at 14, espace Henry Vallee, 69007, Lyon, France. WHEREAS, ADMA (as successor-in-interest to Biotest Pharmaceuticals Corporation (\"BPC\") and Sanofi Pasteur are parties to that certain Manufactu", "connections": 7}, {"id": "8", "name": "ADUROBIOTECH,INC_06_02_2020-EX-10.7-CONSULTING AGREEMENT(1).txt", "group": 5, "description": "Exhibit 10.7\n\nCONSULTING AGREEMENT\n\nAduro Biotech, Inc., with a place of business at 740 Heinz Avenue, Berkeley, CA 94710 (\"Aduro\") and IREYA B.V having an address at Staalwijkstraat 16, 2313 XR Leiden, the Netherlands, represented by Andrea van Elsas, (\"Consultant\") agree to all terms and conditions of this Consulting Agreement (\"Agreement\") dated June 1, 2020, effective as of July 1, 2020 (\"Effective Date\").\n\n1. Services. At the request and direction of Aduro and the agreement of Consultant, Consultant will provide advice and consultation to Aduro with respect to its research, clinical development programs and other business matters as requested by Aduro from time to time.\n\n2. Compensation and Expenses. Aduro shall pay Consultant for the Services at the rate of €500 per hour. On a monthly basis, Consultant shall submit to Aduro an invoice for the hours worked along with itemized documentation and receipts and other information for pre-approved travel and/or out-of- pocket expenses as", "connections": 1}, {"id": "9", "name": "ADUROBIOTECH,INC_06_02_2020-EX-10.7-CONSULTING AGREEMENT.txt", "group": 5, "description": "Exhibit 10.7\n\nCONSULTING AGREEMENT\n\nAduro Biotech, Inc., with a place of business at 740 Heinz Avenue, Berkeley, CA 94710 (\"Aduro\") and IREYA B.V having an address at Staalwijkstraat 16, 2313 XR Leiden, the Netherlands, represented by Andrea van Elsas, (\"Consultant\") agree to all terms and conditions of this Consulting Agreement (\"Agreement\") dated June 1, 2020, effective as of July 1, 2020 (\"Effective Date\").\n\n1. Services. At the request and direction of Aduro and the agreement of Consultant, Consultant will provide advice and consultation to Aduro with respect to its research, clinical development programs and other business matters as requested by Aduro from time to time.\n\n2. Compensation and Expenses. Aduro shall pay Consultant for the Services at the rate of €500 per hour. On a monthly basis, Consultant shall submit to Aduro an invoice for the hours worked along with itemized documentation and receipts and other information for pre-approved travel and/or out-of- pocket expenses as", "connections": 1}, {"id": "10", "name": "AFSALABANCORPINC_08_01_1996-EX-1.1-AGENCY AGREEMENT.txt", "group": 5, "description": "Exhibit 1.1\n\n                                1,265,000 Shares                    (subject to increase up to 1,454,750 shares                       in the event of an oversubscription)\n\n                              AFSALA BANCORP, INC.                             (a Delaware corporation)\n\n                                  COMMON STOCK                            ($0.10 Par Value Per Share)\n\n                      Subscription Price: $10.00 Per Share\n\n                                AGENCY AGREEMENT\n\n                                                            ____________, 1996\n\nCapital Resources, Inc. 1701 K Street, N.W. Suite 700 Washington, D.C. 20006\n\nLadies and Gentlemen:\n\n                  AFSALA  Bancorp,  Inc. (the  \"Company\") and Amsterdam  Federal Savings and Loan  Association,  a federally  chartered  mutual  savings and loan association  (\"Association\"),  with its deposit  accounts insured by the Savings Association   Insurance  Fund  (\"SAIF\")  administered  by  the  Federal  ", "connections": 2}, {"id": "11", "name": "AgapeAtpCorp_20191202_10-KA_EX-10.1_11911128_EX-10.1_Supply Agreement.txt", "group": 5, "description": "ODM - SUPPLY AGREEMENT BETWEEN: ORGANIC PREPARATIONS INC. 2nd Floor, Transpacific Haus Lini Highway, Port Vila. Vanuatu \"the Manufacturer\" -- AND -- AGAPE ATP INTERNATIONAL HOLDING LIMITED Unit 05, 4F, Energy Plaza No. 92, Granville Road Tsim Sha Tsui East Kowloon, Hong Kong \"the Customer\"\n\nSource: AGAPE ATP CORP, 10-K/A, 12/2/2019\n\n\n\n\n\nODM SUPPLY AGREEMENT THIS AGREEMENT is made on the 15t h day of January 2018. BETWEEN: ORGANIC PREPARATIONS INC. 2nd Floor, Transpacific Haus Lini Highway, Port Vila. Vanuatu ('the Manufacturer') of one part AND: AGAPE ATP INTERNATIONAL HOLDING LIMITED Unit 05, 4F, Energy Plaza No. 92, Granville Road Tsim Sha Tsui East Kowloon, Hong Kong ('the Customer') of the other part. RECITALS a. The Manufacturer wishes to appoint the Customer to be the sole and exclusive agent for the promotion, sales, marketing distribution and administration of the Products listed in schedule A of this agreement. b. The Manufacturer and the Customer wish to record their agreemen", "connections": 3}, {"id": "12", "name": "AimmuneTherapeuticsInc_20200205_8-K_EX-10.3_11967170_EX-10.3_Development Agreement.txt", "group": 5, "description": "Exhibit 10.3\n\n[***] Certain information in this document has been excluded pursuant to Regulation S-K, Item 601(b)(10). Such excluded information is not material and would likely cause competitive harm to the registrant if publicly disclosed.\n\nExecution Copy\n\nLICENSE, DEVELOPMENT AND COMMERCIALIZATION AGREEMENT\n\nDATED AS OF FEBRUARY 4, 2020\n\nBY AND BETWEEN\n\nXENCOR, INC.\n\nAND\n\nAIMMUNE THERAPEUTICS, INC.\n\nSource: AIMMUNE THERAPEUTICS, INC., 8-K, 2/5/2020\n\n\n\n\n\nTABLE OF CONTENTS Page ARTICLE 1 Definitions 1\n\nARTICLE 2 Licenses 13\n\nARTICLE 3 Development 16\n\nARTICLE 4 Regulatory 17\n\nARTICLE 5 Commercialization 19\n\nARTICLE 6 Supply 20\n\nARTICLE 7 Payments 21\n\nARTICLE 8 Payment; Records; Audits 24\n\nARTICLE 9 Intellectual Property Matters 26\n\nARTICLE 10 Representations, Warranties and Covenants; Compliance 31\n\nARTICLE 11 Indemnification 34\n\nARTICLE 12 Confidentiality 36\n\nARTICLE 13 Term and Termination 40\n\nARTICLE 14 Effects of Expiration Or Termination 40\n\nARTICLE 15 Miscellaneous 43\n\nSchedule ", "connections": 2}, {"id": "13", "name": "AIRSPANNETWORKSINC_04_11_2000-EX-10.5-Distributor Agreement.txt", "group": 5, "description": "Exhibit 10.5\n\nNote: Portions of this exhibit indicated by\"[*]\" are subject to a confidential treatment request, and have been omitted from this exhibit. Complete, unredacted copies of this exhibit have been filed with the Securities and Exchange Commission as part of this Company's confidential treatment request.\n\nDistributor Agreement                              ---------------------\n\nThis Distributor Agreement (the \"Agreement\") is made effective as of the 31st day of March, 2000 (the \"Effective Date\"), by and between Airspan Networks Incorporated, a company incorporated under the laws of the State of Washington having its principal office at 777 108th Avenue NE, Suite 1895, Bellevue, Washington 98004 (\"Airspan\") and GLS LLC, (\"Distributor\") a limited liability company incorporated under the laws of the State of South Dakota having its principal office at 501 Fourth Street, Sergeant Bluff, IA 51054.\n\nWITNESSETH:\n\nWHEREAS, Airspan is engaged in the design and manufacture of various te", "connections": 5}, {"id": "14", "name": "AIRTECHINTERNATIONALGROUPINC_05_08_2000-EX-10.4-FRANCHISE AGREEMENT.txt", "group": 5, "description": "[LOGO]\n\n                                    EXHIBIT C\n\n                                    AIRSOPURE                                FRANCHISE AGREEMENT\n\nTHIS AGREEMENT is entered into on this ____ day of ___________, 2000, by and between Airsopure International Group, Inc., a Nevada corporation whose principal place of business is located at 15400 Knoll Trail, Suite 200, Dallas, Texas 75248 (hereinafter \"AIRSOPURE\" or by reference \"we\", \"us\", \"our\"), and You:                                    ,     ------------------------------------ whose address is:\n\n- ----------------------------------------\n\n- ---------------------------------------- (hereinafter \"You\" or by reference \"Franchisee\", or \"Your\"). Either Party or both Parties respectively may be referred to as \"Party\" or \"Parties.\"\n\n                                    RECITALS\n\nA. AIRSOPURE and its affiliate design, manufacture and distribute indoor air cleaning systems under the name and mark \"AIRSOPURE\" (the \"Products\").\n\nB. AIRSOP", "connections": 1}, {"id": "15", "name": "ALAMOGORDOFINANCIALCORP_12_16_1999-EX-1-AGENCY AGREEMENT.txt", "group": 5, "description": "ALAMOGORDO FINANCIAL CORPORATION                                 1,101,643 Shares\n\n                                  COMMON STOCK                            (Par Value $.0l Per Share)\n\n                       Subscription Price $10.00 Per Share\n\n                                AGENCY AGREEMENT\n\n                              ___________ __, 2000\n\nCharles Webb & Company, a Division of Keefe, Bruyette & Woods, Inc. 211 Bradenton Avenue Dublin, Ohio 43017\n\nLadies and Gentlemen:\n\n         Alamogordo   Financial   Corporation,   a  federal   corporation   (the \"Company\"), AF Mutual Holding Company (the \"MHC\") and Alamogordo Federal Savings and Loan Association,  a federally  chartered stock savings and loan association (the  \"Bank\")  with its  deposit  accounts  insured by the  Savings  Association Insurance  Fund  (\"SAIF\")   administered  by  the  Federal   Deposit   Insurance Corporation  (\"FDIC\"),  hereby confirm,  jointly and severally,  their agreement with Charles Webb & Company,  a Div", "connections": 2}, {"id": "16", "name": "ALCOSTORESINC_12_14_2005-EX-10.26-AGENCY AGREEMENT.txt", "group": 5, "description": "Exhibit 10.26\n\nAGENCY AGREEMENT\n\nTHIS AGENCY AGREEMENT, dated November 9, 2005 (\"Agreement\"), between General Electric Capital Corporation, a Delaware corporation (together with its successors and assigns, if any, \"Lessor\"), and Duckwall-Alco Stores, Inc., a Kansas corporation (the \"Company\"). Capitalized terms not defined herein shall have the meanings assigned to them in the Lease (as that term is defined below).\n\nRECITALS:\n\nWHEREAS, Lessor and the Company have entered into a Master Lease Agreement dated November 9, 2005 wherein Lessor, as the lessor, has agreed to lease certain items of equipment to the Company (the Master Lease Agreement and all Schedules entered into from time to time thereunder are hereinafter collectively referred to as the \"Lease\"; and all equipment leased thereunder are hereinafter collectively referred to as the \"Equipment\"); capitalized terms used herein but not otherwise defined shall have the meanings as provided in the Lease; and\n\nWHEREAS, Lessor desires ", "connections": 1}, {"id": "17", "name": "ALLIANCEBANCORPINCOFPENNSYLVANIA_10_18_2006-EX-1.2-AGENCY AGREEMENT.txt", "group": 5, "description": "Exhibit 1.2\n\nUp to 2,445,223 Shares\n\n(subject to increase to up to 2,812,006 shares in the event of an increase in the pro forma market value of the Company's Common Stock)\n\nAlliance Bancorp, Inc. of Pennsylvania (a federal stock holding company)\n\nCommon Stock (par value $.01 per share)\n\nAGENCY AGREEMENT\n\nNovember ___, 2006\n\nSANDLER O'NEILL & PARTNERS, L.P. 919 Third Avenue, 6  Floor New York, New York 10022\n\nLadies and Gentlemen:\n\nGreater Delaware Valley Holdings, A Mutual Company, a Pennsylvania-chartered mutual holding company (the \"PA MHC\"), Alliance Mutual Holding Company, a federal mutual savings and loan holding company in formation (the \"Federal MHC\"), Alliance Bancorp, Inc. of Pennsylvania, a federal stock holding company in formation (the \"Company\"), and Greater Delaware Valley Savings Bank d/b/a Alliance Bank, a Pennsylvania-chartered stock savings bank (the \"Bank\"), hereby confirm their agreement with Sandler O'Neill & Partners, L.P. (\"Sandler O'Neill\" or the \"Agent\") with ", "connections": 3}, {"id": "18", "name": "AlliedEsportsEntertainmentInc_20190815_8-K_EX-10.19_11788293_EX-10.19_Content License Agreement.txt", "group": 5, "description": "Exhibit 10.19 JOINT CONTENT LICENSE AGREEMENT This JOINT CONTENT LICENSE AGREEMENT (the \"Agreement\"), dated February 1, 2018 (the \"Effective Date\"), is made by and between WPT Enterprises, Inc., a Delaware corporation, with offices located at 1920 Main Street, Suite 1150, Irvine, CA 92614 (\"WPT\"), and ZYNGA INC., a Delaware corporation with offices located at 699 8th Street, San Francisco CA, 94103 (\"Zynga US\") and ZYNGA GAME IRELAND LIMITED, a limited company organized under the laws of Ireland, resident in Ireland and having its registered office located at The Oval, Building One, Third Floor 160 Shelbourne Road Ballsbridge 4 Co. Dublin Ireland (\"Zynga Ireland,\" and together with Zynga US and their respective Affiliates, \"Zynga\"). In addition to the Definitions set forth in Section 1 of the Additional Provisions (attached and incorporated by reference), all capitalized terms used herein shall have the meanings set forth below. In consideration of the mutual promises herein contained ", "connections": 0}, {"id": "19", "name": "AlliedEsportsEntertainmentInc_20190815_8-K_EX-10.34_11788308_EX-10.34_Sponsorship Agreement.txt", "group": 5, "description": "Exhibit 10.34 EVENT SPONSORSHIP AGREEMENT This Event Sponsorship Agreement (\"Agreement\") is made and effective as of February 1, 2019 (the \"Effective Date\"), by and between Newegg Inc. (\"Newegg\"), a Delaware corporation, and Allied Esports International, Inc., a Nevada corporation (\"Allied\"). Newegg and Allied are hereinafter referred to jointly as the \"Parties\" and each as a \"Party.\" BACKGROUND A. Newegg, an online retailer of items including computer hardware and consumer electronics, is in the business of developing, marketing, selling and supporting gaming accessories and memory products, and proposes to provide promotional and product support as a sponsor for the HyperX Esports Arena Las Vegas (\"the Arena\"). B. Allied is an esports organization that owns and controls the Commercial Rights (as hereinafter defined) to the Arena and wishes to grant rights to Newegg in respect of Newegg's sponsorship of the Arena pursuant to this Agreement. C. Each of the Parties undertakes obligation", "connections": 1}, {"id": "20", "name": "ALLISONTRANSMISSIONHOLDINGSINC_12_15_2014-EX-99.1-COOPERATION AGREEMENT.txt", "group": 5, "description": "Exhibit 99.1\n\nCOOPERATION AGREEMENT\n\nThis Cooperation Agreement (this \"Agreement\") dated December 12, 2014, is by and among the persons and entities listed on Schedule A (collectively, the \"ValueAct Group\", and individually a \"member\" of the ValueAct Group), Allison Transmission Holdings, Inc. (the \"Company\") and Gregory P. Spivy, in his individual capacity and as a member of the ValueAct Group (the \"ValueAct Designee\").\n\nWHEREAS, the ValueAct Group currently beneficially owns 19,125,204 shares of the common stock, par value $0.01 per share, of the Company (the \"Common Stock\"), which represents approximately 10.77% of the issued and outstanding shares of Common Stock.\n\nWHEREAS, the Nominating and Governance Committee of the Board (the \"Nominating Committee\") and the Company's Board of Directors (the \"Board\") have considered the qualifications of the ValueAct Designee and conducted such review as they have deemed appropriate.\n\nWHEREAS, the Board has determined that it is in the best int", "connections": 1}, {"id": "21", "name": "AMBASSADOREYEWEARGROUPINC_11_17_1997-EX-10.28-ENDORSEMENT AGREEMENT.txt", "group": 5, "description": "Exhibit 10.28\n\n                              ENDORSEMENT AGREEMENT\n\n            This Endorsement Agreement (\"Agreement\") is made and entered into as of August 24, 1995, by and among the following parties:\n\n                  (a) Kathy Ireland, Inc. (\"KI Inc.\"), furnishing the services       of Kathy Ireland (\"KI\"), c/o The Sterling/Winters Co., 1900 Avenue of the       Stars, Suite #1640, Los Angeles, California 90067;\n\n                  (b) The Sterling/Winters Co. (\"SW\"), 1900 Avenue of the Stars,       Suite #1640, Los Angeles, California 90067; and\n\n                  (c) Diplomat Ambassador Eyewear Group (\"Diplomat\"), 1010 Arch       Street, 3rd Floor, Philadelphia, Pennsylvania 19107.\n\n            1. Recitals.\n\n                  (a) Whereas Diplomat has created a new product line to be known as \"Kathy Ireland Eyewear\" (\"KI Eyewear\");\n\n                  (b) Whereas Diplomat estimates on a non-binding basis that wholesale sales of KI Eyewear will reach $          during the first Lic", "connections": 0}, {"id": "22", "name": "AMERICANPHYSICIANSCAPITALINC_03_31_2003-EX-10.26-AGENCY AGREEMENT.txt", "group": 5, "description": "EXHIBIT 10.26                                       MICOA                                 AGENCY AGREEMENT\n\n         Mutual Insurance Corporation of America, a Michigan insurance corporation (MICOA) and Stratton, Cheeseman & Walsh-Nevada, Inc., a Nevada corporation, (\"Agency\"), (sometimes commonly referred to as the Parties) agree as follows:\n\nA.       AUTHORITY OF AGENCY\n\n         Subject to requirements imposed by law, the underwriting rules,          procedures and regulations of MICOA and this agreement, the Agency is          authorized to:\n\n         1.       Solicit within the State of Nevada, receive and transmit                   immediately and directly to MICOA, proposals for health care                   liability insurance contracts for which a commission is                   specified in the schedule of commissions provided by Exhibit                   A, attached and as amended or supplemented by such attachments                   from time to time.\n\n         2.       Pro", "connections": 0}, {"id": "23", "name": "AMERICASSHOPPINGMALLINC_12_10_1999-EX-10.2-SITE DEVELOPMENT AND HOSTING AGREEMENT.txt", "group": 5, "description": "EXHIBIT 10.2\n\n                    SITE DEVELOPMENT AND HOSTING AGREEMENT\n\n                  This SITE DEVELOPMENT AND HOSTING AGREEMENT (the \"Agreement\") dated as of August 9, 1999 is made between Hanover Direct, Inc. (\"HDI\"), a New Jersey Corporation, located at 1500 Harbor Boulevard, Weehawken, NJ 07087, and The Deerskin Companies, Inc. (the \"Company\"), a Nevada corporation, located at 2500 Arrowhead Drive, Carson City, NV 89706. Each of the parties hereto shall be referred to as a \"Party\".\n\n                  In consideration of the mutual promises and covenants set forth below, HDI and the Company agree as follows:\n\n1. HDI's Responsibilities.\n\n                  1.1 HDI shall design, develop, implement, operate, maintain and manage, and enable the Company to establish a presence on the World Wide Web (\"Site\") to make available to Internet users on demand, men's and women's apparel and accessories from the Deerskin Catalog (\"Deerskin Products\"). As used in this Agreement, \"Deerskin Pr", "connections": 1}, {"id": "24", "name": "ANIXABIOSCIENCESINC_06_09_2020-EX-10.1-COLLABORATION AGREEMENT.txt", "group": 5, "description": "Exhibit 10.1\n\nRedactions with respect to certain portions hereof denoted with \"***\"\n\nCOLLABORATION AGREEMENT\n\nThis Collaboration Agreement (the \"Agreement\") is made as of April 14th, 2020 (the \"Effective Date\") by and between Anixa Biosciences, Inc., a Delaware corporation, located at 3150 Almaden Expressway, Suite 250, San Jose, CA 95118, U.S.A. (\"Anixa\"), and OntoChem GmbH, a German limited liability company, located at Blücherstr. 24, D-06120 Halle (Saale), Germany (\"OntoChem\"). Anixa and OntoChem are referred to herein individually as a \"Party\" and collectively as the \"Parties.\"\n\nWHEREAS, the Parties wish to collaborate in the discovery and development of novel drug candidates for the treatment of COVID-19 in accordance with the terms and conditions of this Agreement.\n\nNOW, THEREFORE, in consideration of the premises and the mutual promises set forth in this Agreement, and other good and valuable consideration, the receipt and sufficiency of which are hereby acknowledged, the Parti", "connections": 2}, {"id": "25", "name": "Antares Pharma, Inc. - Manufacturing Agreement.txt", "group": 5, "description": "Exhibit 10.3\n\n[***] INDICATES MATERIAL THAT HAS BEEN OMITTED AND FOR WHICH CONFIDENTIAL TREATMENT HAS BEEN REQUESTED. ALL SUCH OMITTED MATERIAL HAS BEEN FILED WITH THE SECURITIES AND EXCHANGE COMMISSION PURSUANT TO RULE 24b-2 PROMULGATED UNDER THE SECURITIES EXCHANGE ACT OF 1934, AS AMENDED\n\nManufacturing Agreement\n\nBetween\n\nAntares Pharma, Inc.\n\nand\n\nAMAG Pharmaceuticals, Inc.\n\n\n\n\n\n[***] INDICATES MATERIAL THAT HAS BEEN OMITTED AND FOR WHICH CONFIDENTIAL TREATMENT HAS BEEN REQUESTED. ALL SUCH OMITTED MATERIAL HAS BEEN FILED WITH THE SECURITIES AND EXCHANGE COMMISSION PURSUANT TO RULE 24b-2 PROMULGATED UNDER THE SECURITIES EXCHANGE ACT OF 1934, AS AMENDED\n\nMANUFACTURING AGREEMENT\n\nThis Manufacturing Agreement (\"Agreement\") is made and entered into as of the 20th day of March, 2018 (the \"Effective Date\") by and between Antares Pharma, Inc., a Delaware corporation, with offices located at 100 Princeton South, Suite 300, Ewing, NJ 08628 (\"Antares\"), and AMAG Pharmaceuticals, Inc., a Delaw", "connections": 7}, {"id": "26", "name": "Apollo Endosurgery - Manufacturing and Supply Agreement.txt", "group": 5, "description": "Exhibit 10.19 CONFIDENTIAL TREATMENT REQUESTED Certain portions of this document have been omitted pursuant to a request for Confidential Treatment and, where applicable, have been marked with \"[***]\" to indicate where omissions have been made. The confidential material has been filed separately with the Securities and Exchange Commission.\n\nMANUFACTURING AND SUPPLY AGREEMENT\n\nThis Manufacturing and Supply Agreement (this \"Agreement\") is entered into as of the Effective Date (as defined below) by and between (1) Apollo Endosurgery, Delaware corporation having offices at 1120 S Capital of Texas Highway #300, Austin, TX 78746 (\"APOLLO\"), and (2) Establishment Labs, S.A a corporation organized under the laws of Costa Rica and having a principal place of business at Coyol Free Zone, B15, Alajuela, 20113, Costa Rica (\"ESTABLISHMENT\"). APOLLO and ESTABLISHMENT shall hereinafter be individually referred to as a \"Party\" and collectively as the \"Parties.\"\n\nRECITALS\n\nA. APOLLO is engaged in the r", "connections": 5}, {"id": "27", "name": "ArcaUsTreasuryFund_20200207_N-2_EX-99.K5_11971930_EX-99.K5_Development Agreement.txt", "group": 5, "description": "Exhibit 99(k)(5) FORM OF BLOCKCHAIN ADMINISTRATION AND DEVELOPMENT AGREEMENT BETWEEN ARCA U.S. TREASURY FUND AND ARCA CAPITAL MANAGEMENT, LLC This Agreement (\"Agreement\") is made as of [___], 2020 by and between ARCA U.S. TREASURY FUND, a Delaware statutory trust (the \"Fund\"), and ARCA CAPITAL MANAGEMENT, LLC, a Delaware limited liability company (the \"Blockchain Administrator\"). WHEREAS, the Fund is a closed-end management investment fund that has registered as an investment company under the Investment Company Act of 1940, as amended (the \"Investment Company Act\") and that intends to operate as an interval fund pursuant to Rule 23c-3 under the Investment Company Act; WHEREAS, the Fund desires to retain the Blockchain Administrator to provide services related to the development of ERC-1404 compatible digital securities and administration of the smart contracts underlying the Fund's digital securities in the manner and on the terms set forth herein; WHEREAS, the Blockchain Administrato", "connections": 0}, {"id": "28", "name": "ArcGroupInc_20171211_8-K_EX-10.1_10976103_EX-10.1_Sponsorship Agreement.txt", "group": 5, "description": "Exhibit 10.1   JACKSONVILLE JAGUARS SPONSORSHIP AGREEMENT   This Sponsorship Agreement (this \"Agreement\") is entered into as of November 27, 2017 (the \"Execution Date\") by and between Jacksonville Jaguars, LLC, a Delaware limited liability company (\"Club\"), and The ARC Group, Inc., a Florida corporation (owner and operator of Dick's Wings and Grill) (\"Sponsor\"). This Agreement consists of this Sponsorship Agreement and Exhibits A and B hereto, each of which is incorporated into and forms a part of this Agreement by this reference.   RECITALS   A. Club owns and operates the National Football League (\"NFL\") team known as the Jacksonville Jaguars (the \"Team\") and has the right to grant sponsorship rights and to exploit certain commercial, advertising and related opportunities with respect to the Team, including at the football- based stadium in Jacksonville, Florida currently named EverBank Field (the \"Stadium\").   B. Sponsor wishes to obtain certain sponsorship rights, benefits and oppor", "connections": 0}, {"id": "29", "name": "ArconicRolledProductsCorp_20191217_10-12B_EX-2.7_11923804_EX-2.7_Trademark License Agreement.txt", "group": 5, "description": "Exhibit 2.7 FORM OF TRADEMARK LICENSE AGREEMENT THIS TRADEMARK LICENSE AGREEMENT (this \"Agreement\"), made and entered into as of the [ ] day of [ ], 2020 (the \"Effective Date\"), by and between ARCONIC INC., a corporation organized under the laws of Delaware (\"Licensee\") and ARCONIC ROLLED PRODUCTS CORP., a corporation organized under the laws of Delaware (\"Licensor\"). WHEREAS, Licensor and Licensee entered into a Separation and Distribution Agreement having an effective date of the [ ] day of [ ], 2020 (\"Separation and Distribution Agreement\"); unless specifically defined in this Agreement, any capitalized term in this Agreement shall have the meaning set forth in the Separation and Distribution Agreement. WHEREAS, Licensor formerly operated as a business unit of Licensee; WHEREAS, as part of and further to the Separation and Distribution Agreement: (a) Licensor and Licensee are now two separate publicly traded companies; and (b) Licensor was assigned all right, title, and interest to ", "connections": 1}, {"id": "30", "name": "ADAMSGOLFINC_03_21_2005-EX-10.17-ENDORSEMENT_AGREEMENT.txt", "group": 6, "description": "REDACTED COPY\n\nCONFIDENTIAL TREATMENT REQUESTED\n\nCONFIDENTIAL PORTIONS OF THIS\n\nDOCUMENT HAVE BEEN REDACTED\n\nAND HAVE BEEN SEPARATELY\n\nFILED WITH THE COMMISSION\n\n  1\n\n\n\n\n\nENDORSEMENT AGREEMENT\n\nThis Agreement is entered into on January 13, 2005 between professional golfer, TOM WATSON, (hereinafter referred to as \"CONSULTANT\") and ADAMS GOLF, LTD. (hereinafter referred to as \"ADAMS GOLF\").\n\nWITNESSETH\n\nWHEREAS, ADAMS GOLF desires to obtain the right to use the name, likeness and ENDORSEMENT of CONSULTANT in connection with the advertisement and promotion of ADAMS GOLF'S PRODUCT;\n\nNOW THEREFORE, in consideration of the mutual covenants contained herein and other good and valuable consideration, the receipt and sufficiency of which is hereby acknowledged, the parties agree as follows:\n\nCONTRACT PERIOD\n\n1.   TERM OF CONTRACT\n\nThe Term of this Agreement shall be for a period of [* ****] years and [*****] months commencing the 1st day of September 2004 and terminating the [*****] day of [***", "connections": 1}], "links": [{"source": "1", "target": "11", "value": 0.5589025020599365}, {"source": "1", "target": "26", "value": 0.5021350383758545}, {"source": "3", "target": "7", "value": 0.5016129016876221}, {"source": "3", "target": "13", "value": 0.5376927852630615}, {"source": "3", "target": "25", "value": 0.5248357653617859}, {"source": "3", "target": "26", "value": 0.5275149345397949}, {"source": "4", "target": "30", "value": 1.0000001192092896}, {"source": "5", "target": "7", "value": 0.5011014938354492}, {"source": "5", "target": "25", "value": 0.5517940521240234}, {"source": "7", "target": "11", "value": 0.516990602016449}, {"source": "7", "target": "12", "value": 0.5219696164131165}, {"source": "7", "target": "24", "value": 0.5125270485877991}, {"source": "7", "target": "25", "value": 0.729141354560852}, {"source": "7", "target": "26", "value": 0.5677183270454407}, {"source": "8", "target": "9", "value": 0.9999997615814209}, {"source": "10", "target": "15", "value": 0.5835837125778198}, {"source": "10", "target": "17", "value": 0.6039531230926514}, {"source": "11", "target": "13", "value": 0.5171463489532471}, {"source": "12", "target": "25", "value": 0.5350710153579712}, {"source": "13", "target": "14", "value": 0.5438132882118225}, {"source": "13", "target": "25", "value": 0.5509381294250488}, {"source": "13", "target": "26", "value": 0.5464181900024414}, {"source": "15", "target": "17", "value": 0.5055249929428101}, {"source": "16", "target": "29", "value": 0.5504676103591919}, {"source": "17", "target": "20", "value": 0.5096811056137085}, {"source": "19", "target": "23", "value": 0.5152263045310974}, {"source": "24", "target": "25", "value": 0.5514345169067383}, {"source": "25", "target": "26", "value": 0.6502861976623535}], "metadata": {"field_groups": {"web": 1, "mobile": 2, "cybersecurity": 3, "iot": 4, "file": 5, "new": 6}, "total_nodes": 31, "total_links": 28}}